In [1]:
"""

- We can add dictionaries and lists to DataFrame
- If need help can type dir(df1)
- df1.<<Column>> is a DataFrame which contains almost same methods than "pandas.DataFrame"

"""
import pandas

data_df1 = []
data_df1.append(["COD01", "John", 26, ""])
data_df1.append(["COD02", "Jane", 28, ""])
data_df1.append(["COD03", "Paul", 45, ""])
data_df1.append(["COD04", "Nana", 23, ""])
data_df1.append(["COD05", "Jeff", 35, ""])
data_df1.append(["COD06", "Alan", 52, ""])

df1 = pandas.DataFrame(data_df1, columns=["ID", "Name", "Age", "Category"])

"""

It is possible to define if conditions to generate column values

"""
df1.loc[df1.Age >= 30, "Category"] = "Mature"
df1.loc[df1.Age < 30, "Category"] = "Young"
df1.loc[df1.Age >= 50, "Category"] = "Old"

# Set column index and replace Dataframe
df1 = df1.set_index("ID")

# Add index ranges "from ID to ID" and "from FIELD to FIELD"
df1 = df1.loc["COD02":"COD05", "Age":"Category"]

# Add a filter to include only employees youngers than 45 years old
df1 = df1.loc[df1.Age < 45]

df1

       Age Category
ID
COD02   28    Young
COD04   23    Young
COD05   35   Mature

In [21]:
"""
It is possible to drop columns
"""
df1_2 = pandas.DataFrame(data_df1, columns=["ID", "Name", "Age", "Category"])
df1_2.drop("Category",1)

      ID  Name  Age
0  COD01  John   26
1  COD02  Jane   28
2  COD03  Paul   45
3  COD04  Nana   23
4  COD05  Jeff   35
5  COD06  Alan   52

In [24]:
"""
It is possible to drop rows by index
"""
df1_3 = pandas.DataFrame(data_df1, columns=["ID", "Name", "Age", "Category"])
df1_3 = df1_3.set_index("ID")
df1_3.drop("COD01",0)

       Name  Age Category
ID
COD02  Jane   28
COD03  Paul   45
COD04  Nana   23
COD05  Jeff   35
COD06  Alan   52

In [25]:
"""
It is possible to drop rows by index positions ranges
"""
df1_4 = pandas.DataFrame(data_df1, columns=["ID", "Name", "Age", "Category"])
df1_4 = df1_4.set_index("ID")
df1_4.drop(df1_4.index[0:3],0)

       Name  Age Category
ID
COD04  Nana   23
COD05  Jeff   35
COD06  Alan   52

In [28]:
"""

It is possible to drop columns by index positions ranges

"""
df1_5 = pandas.DataFrame(data_df1, columns=["ID", "Name", "Age", "Category"])
df1_5.drop(df1_5.columns[2:4],1)

      ID  Name
0  COD01  John
1  COD02  Jane
2  COD03  Paul
3  COD04  Nana
4  COD05  Jeff
5  COD06  Alan

In [ ]:
# It is also possible to get objects by specific position index and
df1_index = pandas.DataFrame(data_df1, columns=["ID", "Name", "Age", "Category"])
df1_index = df1_index.iloc[3, 1:3]

df1_index

In [ ]:
# And get values from specific index positions and fields
df1_index_value = pandas.DataFrame(data_df1, columns=["ID", "Name", "Age", "Category"])
df1_index_value = df1_index_value.loc[3, "Name"]

df1_index_value

In [ ]:
data_df2 = []
data_df2.append({"Profession": "Programmer", "Salary": 50000})
data_df2.append({"Profession": "Engineer", "Salary": 70000})
data_df2.append({"Profession": "Lawyer", "Salary": 65000})
data_df2.append({"Profession": "Carpenter", "Salary": 40000})
data_df2.append({"Profession": "Waitress", "Salary": 35000})

df2 = pandas.DataFrame(data_df2, columns=["Profession", "Salary"])

"""
It is possible to filter results. I.e: Get salaries > 40000
"""
df2 = df2[df2.Salary > 40000]

# Set column index and replace Dataframe
df2 = df2.set_index("Profession")

df2

In [ ]:
"""
It is possible to load data in many formats
"""
print("\nFrom JSON")
df3 = pandas.read_json("supermarkets.json")
df3

In [ ]:
print("\nFrom CSV")
df4 = pandas.read_csv("supermarkets.csv")
df4

In [ ]:
df5 = pandas.read_excel("supermarkets.xlsx", sheet_name=0)
df5

In [ ]:
print("\nFrom txt comma separated")
df6 = pandas.read_csv("supermarkets-commas.txt")
df6

In [ ]:
print("\nFrom txt semi-colons separated")
df7 = pandas.read_csv("supermarkets-semi-colons.txt", sep=";")
df7